// use strik

'number' + 3 + 3 
// Тут відбувається конкатенація, тобто до стрінги додається два намбер значення і джаваскріпт це запише як один рядок. Отже, результат: number33

null + 3 
// Тут також відбувається оператор додавання. null перетворюється завжди на 0, а 3 вже є число, тому результат буде 3.

5 && "qwerty" 
// Тут працює логічний оператор 'і' ('and') який повертає останнє значення якщо воно true. Тут в нас два значення true - отже має повернути останнє true значення. 5 = true, "qwerty" = true але воно останнє. Тому результат буде "qwerty".

+'40' + +'2' + "hillel" 
// Тут є унарний плюс який завжди перетворю значення на число. +'40' буде 40, +'2' буде 2. "hillel" не можна перетворити на число тому відбувається конкатинація - додаємо все разом і отримуємо результат - 42hillel

'10' - 5 === 6;
 // '10' був стрінгою тепер перетворюється просто на число 10. 10 - 5 = 5. Потім в нас йде оператор строгої рівності. Ми порівнюємо два значення (5 і 6) на рівність за типом данних. Тип данних однаковий - number, але вони не рівні - тому результат false.

 true + false 
// Тут таокж оператор додавання. JavaScript перетворює булеві значення на числа і додає їх. Отже, результат буде 1. (true перетворюється на 1 + false перетворюється на 0)

'4px' - 3
// Тут JavaScript буде намагтися перетворити стрінгу на число, але це неможливо і JavaScript зарахує це як за NaN. NaN + 3 - буде результат NaN, Тому що NaN нічому не відповідає і будь яка операція з ним буде NaN.

'4' - 3 
// Тут використовується бінарний мінус. 4 в лапках це стрінга і джава перетворить це на число, отже 4 - 3 буде 1. 

'6' + 3 ** 0 
// Тут також використовується конкатинація і зведення в ступінь. Результат буде 61, так як спочатку виконуємо операцію з  і в нас буде 1. Далі відбувається конкатенація. 

12 / '6' 
// Використовується операція поділу. 6 перетворюється на число, тут немає конкатенації, тому 12 / 6 буде 2.

'10' + (5 === 6) 
// Тут в першу чергу йде оператор строгої рівності так як він в дужках, і там буде false, потім відбувається конкатенація і результатом буде 10false.

null == ' ' 
// Використовується оператор рівності. В нас значення null завжди дорівнює undefined. Якщо порівняти undefined зі стрінгою результатом буде - false, так як стрінга не зовсім пуста, там просто нічого немає.

3 ** (9 / 3) 
// Тут в першу чергу використовується оператор поділу. Він приорітетний так як він в дужках. 9 / 3 буде 3 і потім 3 в 3 степені буде результат 27.

!!'false' == !!'true' 
// Тут використовується подвійне перетворення на boolean (!!). Дві стрінги - 'false' і 'true' - не пусті значення. Потім ми використовуємо оператор рівності і в результаті отримаємо true. Так як це дві не пусті рядкі.

0 || '0' && 1 
// Тут використовується одразу два булевих оператори для логічних операцій (АБО та і). В приорітетах почати з оператору і - там результат буде 1. Потім 0 || 1 - результатом буде 1, так як цей оператор виводить true значення.

(+null == false) < 1
// Тут використовується унарний плюс, оператор рівності і оператор менше. Те що в дужках є пріоритетом, отже +null буде 0 і порівнюємо з false - результат в дужках буде true. True НЕ менше 1, так як true прирівнюється до одного, одже кінечний результат буде false.

false && true || true 
// Тут два оператори - і та АБО. false && true - буде false, потім false  true - буде true. Результат true.

false && (false || true) 
// Тут ті самі операції але починаємо з дужок так як це пріоритет. false || true  - буде true, потім false && true буде false. Результат false.

(+null == false) < 1 ** 5 
// Тут використовуються такі оператори: Унарний плюс, оператор рівності, оператор менше та оператор піднесення до степеня. Те що в дужках - пріоритет, отже, 0 == false - буде true. true перетворюється на 1. Далі, підносимо 1 до 5 степені - буде 1. 1 НЕ більше 1, отже результат буде  - false.